modules/ged/views/default/index.php

/** @var array $datosEscuelas */

$this->title = 'Gestión Escuelas Deportivas';
$totalEscuelas = Escuela::find()->where(['eliminado' => false])->count();
---
SELECT COUNT(*) FROM "atletas"."escuela" WHERE "eliminado"=FALSE