modules/atletas/views/asistencia/registro-multiple.php

SELECT * FROM "atletas"."escuela" WHERE "eliminado"=FALSE ORDER BY "nombre"
---
                                                <label class="form-label fw-bold">Escuela/Club:</label>
                                                <select name="id_escuela" id="select-escuela" class="form-control form-control-lg" required>
                                                    <option value="">-- Seleccione una Escuela --</option>
                                                    <?php foreach (Escuela::find()->where(['eliminado' => false])->orderBy(['nombre' => SORT_ASC])->all() as $escuela): ?>