modules/ged/controllers/DefaultController.php

    public function actionIndex()
    {
        $session = Yii::$app->session;
        $request = Yii::$app->request;

        // ✅ OBTENER DATOS PARA LA VISTA PRINCIPAL
        $todasLasEscuelas = Escuela::find()
            ->where(['eliminado' => false])
            ->orderBy(['nombre' => SORT_ASC])
            ->all();
---
SELECT * FROM "atletas"."escuela" WHERE "eliminado"=FALSE ORDER BY "nombre"

    public function actionSelectEscuela()
    {
        $session = Yii::$app->session;
        $request = Yii::$app->request;

        // ✅ LIMPIAR BANDERA DE REDIRECCIÓN
        $session->remove('en_redireccion_ged');

        // ✅ OBTENER LISTA DE ESCUELAS ACTIVAS (no eliminadas)
        $escuelas = Escuela::find()
            ->where(['eliminado' => false])
            ->orderBy(['nombre' => SORT_ASC])
            ->all();
---
SELECT * FROM "atletas"."escuela" WHERE "eliminado"=FALSE ORDER BY "nombre"

    private function validarEscuela($id_escuela)
    {
        if (empty($id_escuela) || !is_numeric($id_escuela)) {
            return false;
        }

        $escuela = Escuela::find()
            ->where(['id' => $id_escuela, 'eliminado' => false])
            ->one();
---
SELECT * FROM "atletas"."escuela" WHERE ("id"=2) AND ("eliminado"=FALSE)

    private function actualizarSesionEscuela($id_escuela)
    {
        $escuela = Escuela::findOne($id_escuela);
---
SELECT * FROM "atletas"."escuela" WHERE "id"='2'