models/User.php

SELECT * FROM "seguridad"."user" WHERE ("id"=1) AND ("status"=10)
---
    public static function findIdentity($id)
    {
        return static::findOne(['id' => $id, 'status' => self::STATUS_ACTIVE]);